import random

gallows = [
    '''
========||
   |    ||
        ||
        ||
        ||
       /||\\
==========
    ''',
    '''
========||
   |    ||
   o    ||
        ||
        ||
       /||\\
==========
    ''',
    '''
========||
   |    ||
   o    ||
   0    ||
        ||
       /||\\
==========
    ''',
    '''
========||
   |    ||
   o    ||
  /0    ||
        ||
       /||\\
==========
    ''',
    '''
========||
   |    ||
   o    ||
  /0\\   ||
        ||
       /||\\
==========
    ''',
    '''
========||
   |    ||
   o    ||
  /0\\   ||
  /     ||
       /||\\
==========
    ''',
    '''
========||
   |    ||
   o    ||
  /0\\   ||
  / \\   ||
       /||\\
==========
    ''',
]

with open('words.txt') as file:
    words = file.read().splitlines()

secret = random.choice(words)

print('Игра "Виселица". Компьютер загадал слово. Попытайтесь его отгадать.')

сorrect = ['а', 'н']
wrong = ['п', 'в']
secret = 'карандаш'
